In [125]:
import pandas as pd
import numpy as np
from collections import Counter
import warnings
warnings.filterwarnings("ignore")

In [126]:
df = pd.read_csv("bank_data.csv")

In [127]:
df

,Unnamed: 0,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,0,30,unemployed,married,NaN,no,1787.0,no,no,cellular,19,oct,79.0,1,-1,0,unknown,no
1,1,33,services,married,secondary,no,4789.0,yes,yes,cellular,11,may,NaN,1,339,4,failure,no
2,2,35,management,single,tertiary,no,1350.0,yes,no,cellular,16,apr,185.0,1,330,1,failure,no
3,3,30,management,married,tertiary,no,1476.0,yes,yes,unknown,3,jun,199.0,4,-1,0,unknown,no
4,4,59,blue-collar,married,secondary,no,0.0,yes,no,unknown,5,may,226.0,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,4516,33,services,married,secondary,no,-333.0,yes,no,cellular,30,jul,329.0,5,-1,0,unknown,no
4517,4517,57,self-employed,married,tertiary,yes,-3313.0,yes,yes,unknown,9,may,153.0,1,-1,0,unknown,no
4518,4518,57,technician,married,secondary,no,295.0,no,no,cellular,19,aug,151.0,11,-1,0,unknown,no
4519,4519,28,blue-collar,married,secondary,no,1137.0,no,no,cellular,6,feb,129.0,4,211,3,other,no
4520,4520,44,entrepreneur,single,tertiary,no,1136.0,yes,yes,cellular,3,apr,345.0,2,249,7,other,no

In [128]:
df_new =pd.read_csv("bank_data.csv").drop(["Unnamed: 0"],axis=1)
df_new

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,NaN,no,1787.0,no,no,cellular,19,oct,79.0,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789.0,yes,yes,cellular,11,may,NaN,1,339,4,failure,no
2,35,management,single,tertiary,no,1350.0,yes,no,cellular,16,apr,185.0,1,330,1,failure,no
3,30,management,married,tertiary,no,1476.0,yes,yes,unknown,3,jun,199.0,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0.0,yes,no,unknown,5,may,226.0,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333.0,yes,no,cellular,30,jul,329.0,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313.0,yes,yes,unknown,9,may,153.0,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295.0,no,no,cellular,19,aug,151.0,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137.0,no,no,cellular,6,feb,129.0,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136.0,yes,yes,cellular,3,apr,345.0,2,249,7,other,no

In [129]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
age          4521 non-null int64
job          4521 non-null object
marital      4510 non-null object
education    4514 non-null object
default      4521 non-null object
balance      4515 non-null float64
housing      4518 non-null object
loan         4518 non-null object
contact      4486 non-null object
day          4521 non-null int64
month        4521 non-null object
duration     4514 non-null float64
campaign     4521 non-null int64
pdays        4521 non-null int64
previous     4521 non-null int64
poutcome     4521 non-null object
y            4521 non-null object
dtypes: float64(2), int64(5), object(10)
memory usage: 600.6+ KB

In [130]:
df_new.isnull().sum()

age           0
job           0
marital      11
education     7
default       0
balance       6
housing       3
loan          3
contact      35
day           0
month         0
duration      7
campaign      0
pdays         0
previous      0
poutcome      0
y             0
dtype: int64

In [131]:
df_new.shape

(4521, 17)

In [132]:
#(df['marital']).value_counts()
Counter(df_new['marital'])

Counter({'married': 2790, 'single': 1193, 'divorced': 527, nan: 11})

In [133]:
marital_null = df_new[df_new['marital'].isnull()].index.tolist()
marital_null

[46, 49, 50, 52, 54, 56, 306, 310, 312, 367, 445]

In [134]:
df_new['marital'].iloc[marital_null] = "married"

In [135]:
df_new.isnull().sum()

age           0
job           0
marital       0
education     7
default       0
balance       6
housing       3
loan          3
contact      35
day           0
month         0
duration      7
campaign      0
pdays         0
previous      0
poutcome      0
y             0
dtype: int64

In [136]:
print(Counter(df_new['education']))

Counter({'secondary': 2302, 'tertiary': 1349, 'primary': 676, 'unknown': 187, nan: 7})

In [137]:
education_null = df_new[df_new['education'].isnull()].index.tolist()
education_null

[0, 37, 111, 358, 365, 515, 770]

In [138]:
df_new['education'].iloc[education_null] = "secondary"

In [139]:
df_new.isnull().sum()

age           0
job           0
marital       0
education     0
default       0
balance       6
housing       3
loan          3
contact      35
day           0
month         0
duration      7
campaign      0
pdays         0
previous      0
poutcome      0
y             0
dtype: int64

In [140]:
print(df_new['balance'])

0       1787.0
1       4789.0
2       1350.0
3       1476.0
4          0.0
         ...
4516    -333.0
4517   -3313.0
4518     295.0
4519    1137.0
4520    1136.0
Name: balance, Length: 4521, dtype: float64

In [141]:
balance_null = df_new[df_new['balance'].isnull()].index.tolist()
balance_null

[16, 38, 136, 367, 455, 543]

In [142]:
(df_new['balance']).value_counts()

0.0       357
2.0        24
1.0        15
4.0        13
23.0       11
         ...
6767.0      1
6053.0      1
1825.0      1
1054.0      1
1646.0      1
Name: balance, Length: 2351, dtype: int64

In [143]:
df_new['balance'][df_new['balance'].isnull()]=0.0

In [144]:
df_new.isnull().sum()

age           0
job           0
marital       0
education     0
default       0
balance       0
housing       3
loan          3
contact      35
day           0
month         0
duration      7
campaign      0
pdays         0
previous      0
poutcome      0
y             0
dtype: int64

In [145]:
print(Counter(df_new['housing']))

Counter({'yes': 2557, 'no': 1961, nan: 3})

In [146]:
housing_null = df_new[df_new['housing'].isnull()].index.tolist()
housing_null

[3131, 3215, 3391]

In [147]:
df_new['housing'].iloc[housing_null] = "yes"

In [148]:
df_new.isnull().sum()

age           0
job           0
marital       0
education     0
default       0
balance       0
housing       0
loan          3
contact      35
day           0
month         0
duration      7
campaign      0
pdays         0
previous      0
poutcome      0
y             0
dtype: int64

In [149]:
print(Counter(df_new['loan']))

Counter({'no': 3827, 'yes': 691, nan: 3})

In [150]:
loan_null = df_new[df_new['loan'].isnull()].index.tolist()
loan_null

[3138, 3293, 3469]

In [151]:
df_new['loan'].iloc[loan_null] = "no"

In [152]:
df_new.isnull().sum()

age           0
job           0
marital       0
education     0
default       0
balance       0
housing       0
loan          0
contact      35
day           0
month         0
duration      7
campaign      0
pdays         0
previous      0
poutcome      0
y             0
dtype: int64

In [153]:
print(Counter(df_new['contact']))

Counter({'cellular': 2869, 'unknown': 1319, 'telephone': 298, nan: 35})

In [154]:
contact_null = df_new[df_new['contact'].isnull()].index.tolist()
contact_null

[43,
 48,
 51,
 53,
 56,
 186,
 192,
 269,
 305,
 306,
 367,
 447,
 502,
 505,
 540,
 542,
 543,
 600,
 602,
 604,
 681,
 683,
 684,
 761,
 762,
 828,
 829,
 913,
 916,
 1376,
 1377,
 1378,
 1553,
 1554,
 1555]

In [155]:
df_new['contact'].iloc[contact_null] = "cellular"

In [156]:
df_new.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     7
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [157]:
print(df_new['duration'])

0        79.0
1         NaN
2       185.0
3       199.0
4       226.0
        ...
4516    329.0
4517    153.0
4518    151.0
4519    129.0
4520    345.0
Name: duration, Length: 4521, dtype: float64

In [158]:
duration_null = df_new[df_new['duration'].isnull()].index.tolist()
duration_null

[1, 15, 185, 345, 443, 660, 665]

In [159]:
(df_new['duration']).value_counts()

123.0     27
104.0     25
119.0     23
121.0     22
106.0     22
          ..
721.0      1
530.0      1
718.0      1
637.0      1
1236.0     1
Name: duration, Length: 874, dtype: int64

In [160]:
df_new['duration'][df_new['duration'].isnull()]=123.0

In [161]:
df_new.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [162]:
df_new.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,secondary,no,1787.0,no,no,cellular,19,oct,79.0,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789.0,yes,yes,cellular,11,may,123.0,1,339,4,failure,no
2,35,management,single,tertiary,no,1350.0,yes,no,cellular,16,apr,185.0,1,330,1,failure,no
3,30,management,married,tertiary,no,1476.0,yes,yes,unknown,3,jun,199.0,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0.0,yes,no,unknown,5,may,226.0,1,-1,0,unknown,no

In [164]:
df_new1=pd.get_dummies(df_new.drop(['job'],axis=1),drop_first=True)
df_new1

,age,balance,day,duration,campaign,pdays,previous,marital_married,marital_single,education_secondary,...,month_jun,month_mar,month_may,month_nov,month_oct,month_sep,poutcome_other,poutcome_success,poutcome_unknown,y_yes
0,30,1787.0,19,79.0,1,-1,0,1,0,1,...,0,0,0,0,1,0,0,0,1,0
1,33,4789.0,11,123.0,1,339,4,1,0,1,...,0,0,1,0,0,0,0,0,0,0
2,35,1350.0,16,185.0,1,330,1,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,30,1476.0,3,199.0,4,-1,0,1,0,0,...,1,0,0,0,0,0,0,0,1,0
4,59,0.0,5,226.0,1,-1,0,1,0,1,...,0,0,1,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,-333.0,30,329.0,5,-1,0,1,0,1,...,0,0,0,0,0,0,0,0,1,0
4517,57,-3313.0,9,153.0,1,-1,0,1,0,0,...,0,0,1,0,0,0,0,0,1,0
4518,57,295.0,19,151.0,11,-1,0,1,0,1,...,0,0,0,0,0,0,0,0,1,0
4519,28,1137.0,6,129.0,4,211,3,1,0,1,...,0,0,0,0,0,0,1,0,0,0
4520,44,1136.0,3,345.0,2,249,7,0,1,0,...,0,0,0,0,0,0,1,0,0,0

In [165]:
X=df_new1.drop(['y_yes'],axis=1)
y=df_new1['y_yes']

In [166]:
X.head()

,age,balance,day,duration,campaign,pdays,previous,marital_married,marital_single,education_secondary,...,month_jul,month_jun,month_mar,month_may,month_nov,month_oct,month_sep,poutcome_other,poutcome_success,poutcome_unknown
0,30,1787.0,19,79.0,1,-1,0,1,0,1,...,0,0,0,0,0,1,0,0,0,1
1,33,4789.0,11,123.0,1,339,4,1,0,1,...,0,0,0,1,0,0,0,0,0,0
2,35,1350.0,16,185.0,1,330,1,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,30,1476.0,3,199.0,4,-1,0,1,0,0,...,0,1,0,0,0,0,0,0,0,1
4,59,0.0,5,226.0,1,-1,0,1,0,1,...,0,0,0,1,0,0,0,0,0,1

In [167]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: y_yes, dtype: uint8

In [168]:
from sklearn.model_selection import train_test_split

In [169]:
X_train, X_test, y_train, y_test = train_test_split(X, y)

In [170]:
X_train.shape

(3390, 31)

In [171]:
X_test.shape

(1131, 31)

In [184]:
y_train.shape

(3390,)

In [172]:
from sklearn.preprocessing import StandardScaler

In [173]:
scaler = StandardScaler()

In [174]:
# Fit only to the training data
scaler.fit(X)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [175]:
# Now apply the transformations to the data:
X_train = scaler.transform(X_train)
X_test = scaler.transform(X_test)

In [176]:
X_train[:5]

array([[ 0.0784777 , -0.47180816,  0.37405206,  0.40954033, -0.57682947,
        -0.4072183 , -0.32041282,  0.78362389, -0.59872661,  0.97876988,
        -0.65213782, -0.20771906, -0.1307588 , -1.14256571, -0.42475611,
        -0.26564252,  1.55807467, -0.40349553, -0.06665926, -0.22724418,
        -0.18396751, -0.43018482,  2.74119031, -0.10467601, -0.66906389,
        -0.30682776, -0.1342161 , -0.10786896, -0.21344711, -0.1713814 ,
         0.46930045],
       [ 0.0784777 , -0.34478362, -0.35350683,  0.11682934, -0.57682947,
        -0.4072183 , -0.32041282, -1.2761224 ,  1.67021137,  0.97876988,
        -0.65213782, -0.20771906, -0.1307588 ,  0.87522319, -0.42475611,
        -0.26564252, -0.64181777, -0.40349553, -0.06665926, -0.22724418,
        -0.18396751, -0.43018482, -0.36480503, -0.10467601,  1.49462556,
        -0.30682776, -0.1342161 , -0.10786896, -0.21344711, -0.1713814 ,
         0.46930045],
       [ 0.64585137,  1.37137782,  0.01027262, -0.46474119,  0.7095664 ,
        -0.4072183 , -0.32041282,  0.78362389, -0.59872661, -1.02169062,
        -0.65213782,  4.8141947 , -0.1307588 , -1.14256571, -0.42475611,
        -0.26564252,  1.55807467, -0.40349553, -0.06665926, -0.22724418,
        -0.18396751, -0.43018482,  2.74119031, -0.10467601, -0.66906389,
        -0.30682776, -0.1342161 , -0.10786896, -0.21344711, -0.1713814 ,
         0.46930045],
       [-0.01608458, -0.45451686,  0.49531188, -0.01026886, -0.2552305 ,
        -0.4072183 , -0.32041282, -1.2761224 , -0.59872661,  0.97876988,
        -0.65213782, -0.20771906, -0.1307588 , -1.14256571, -0.42475611,
        -0.26564252, -0.64181777,  2.47834221, -0.06665926, -0.22724418,
        -0.18396751, -0.43018482, -0.36480503, -0.10467601, -0.66906389,
        -0.30682776, -0.1342161 , -0.10786896, -0.21344711, -0.1713814 ,
         0.46930045],
       [ 0.36216454,  3.88992205, -0.59602646, -0.8537387 , -0.2552305 ,
        -0.4072183 , -0.32041282,  0.78362389, -0.59872661, -1.02169062,
        -0.65213782, -0.20771906, -0.1307588 , -1.14256571, -0.42475611,
        -0.26564252,  1.55807467, -0.40349553, -0.06665926, -0.22724418,
        -0.18396751, -0.43018482,  2.74119031, -0.10467601, -0.66906389,
        -0.30682776, -0.1342161 , -0.10786896, -0.21344711, -0.1713814 ,
         0.46930045]])

In [177]:
from sklearn import svm

In [178]:
clf = svm.SVC(kernel='linear', C = 1.0)
clf.fit(X_train, y_train)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='auto_deprecated',
    kernel='linear', max_iter=-1, probability=False, random_state=None,
    shrinking=True, tol=0.001, verbose=False)

In [179]:
predictions = clf.predict(X_test)

In [180]:
from sklearn.metrics import classification_report,confusion_matrix

In [181]:
print(confusion_matrix(y_test,predictions))

[[987  13]
 [105  26]]

In [182]:
print(classification_report(y_test,predictions))

              precision    recall  f1-score   support

           0       0.90      0.99      0.94      1000
           1       0.67      0.20      0.31       131

    accuracy                           0.90      1131
   macro avg       0.79      0.59      0.62      1131
weighted avg       0.88      0.90      0.87      1131